prodotto-kar/src/main/resources/NoPlugin/Esempi/DCSanita_FSE_2008-02_ricercaEventi.in.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<!--
<TestInfo>
	<Autore>Salvatore Manfredi</Autore>
	<DataPreparazione>08/05/2009</DataPreparazione>
	<CodiceTest>IN.8058000030</CodiceTest>
	<CodiceContesto>C06</CodiceContesto>
	<TipoTest>F</TipoTest>
	<Priorita>H</Priorita>
	<DescrizioneCaso>Test sulle ricerche positive senza idTipoEvento: in questo caso esiste un evento Specialistico, uno di ricovero e uno PS, in stato 'accettato'. Gli attributi maxRecords e numeroPagina non sono valorizzati, il servizio utilizza i valori di default (per maxRecords, dc.sebc.FSE.configurazione.MAX_EVENTI_SANITARI attualmente impostato a 40, mentre per numeroPagina, 1)</DescrizioneCaso>
	<DescrizioneRisultatoAtteso>Vengono estratti correttamente i dati di dettaglio degli eventi</DescrizioneRisultatoAtteso>
	<confrontoBody>
		<ignora>//idSetDocumenti</ignora>
	</confrontoBody></TestInfo>
-->
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" soap-env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<soap-env:Header>
		<t:CoopContext xmlns:t="http://www.crs.lombardia.it/schemas/mw/2004-01/coopcontext/">
			<Sla>
				<Log>
					<Global>
						<TrackID>121551124945253853</TrackID>
						<Timestamp>08-07-2008 12:00:49</Timestamp>
					</Global>
				</Log>
			</Sla>
			<Security>
				<CitCardPresent>false</CitCardPresent>
				<CitAuth>false</CitAuth>
				<CitCF>GBBGCB70A01Z368C</CitCF>
				<CitSmartCardSN/>
				<FunContext>
					<credential>
						<vrs>
							<mjr>2</mjr>
							<min>1</min>
						</vrs>
						<validity>
							<emittedDate>08/07/2008 11:57:22</emittedDate>
							<sessionMaxTime>28800000</sessionMaxTime>
						</validity>
						<role>
							<code>5</code>
							<description>Direttore Medico</description>
						</role>
						<userId>DVLMMG69A11F205N</userId>
						<FirstName>MMG</FirstName>
						<LastName>DVALOTTO</LastName>
						<ctf>
							<reg>
								<cod/>
								<des/>
							</reg>
							<app>
								<cod/>
								<des/>
							</app>
							<pro>
								<cod/>
								<des/>
							</pro>
							<ter>
								<cod/>
								<des/>
							</ter>
							<pre>
								<cod>03038000</cod>
								<des/>
							</pre>
							<str>
								<cod>691489</cod>
								<des>A.O. OSPEDALE DI LECCO - LECCO</des>
							</str>
						</ctf>
						<prv>
							<iupSeed>00000</iupSeed>
							<DF>F</DF>
							<Ref>DVALOTTO/MMG/DVLMMG69A11F205N/17941</Ref>
						</prv>
					</credential>
				</FunContext>
			</Security>
			<Transport>
				<Mode>Sync</Mode>
				<Dest>DCSanita</Dest>
			</Transport>
		</t:CoopContext>
		<a:AppContext xmlns:a="http://www.crs.lombardia.it/schemas/mw/2004-01/appcontext/">
			<Request clientProd="DCSanita" clientVer="1.0"/>
		</a:AppContext>
	</soap-env:Header>
	<soap-env:Body>
		<m:FSE.ricercaEventi xmlns:m="http://www.crs.lombardia.it/schemas/DCSanita/FSE/2008-02/ricercaEventi/" dataSetVersion="1.0">
			<evento>
				<strutturaErogazione>
					<idEnte>691489</idEnte>
					<idPresidio>03038000</idPresidio>
				</strutturaErogazione>
				<cittadino>
					<idCittadino tipo="CF">GBBGCB70A01Z368C</idCittadino>
				</cittadino>
				<idTipoEvento/>
				<idEvento/>
				<dataInizio/>
				<dataFine/>
				<maxRecords/>
				<numeroPagina/>
			</evento>
		</m:FSE.ricercaEventi>
	</soap-env:Body>
</soap-env:Envelope>
